//
//  footerItems.swift
//  TengizReportSPTests
//
//  Created by Igor Malyarov on 06.02.2021.
//

import Foundation

let selectedFooterItems = [
    "ИТОГ всех расходов за месяц:\t92.531р 15к",
    "ИТОГ всех расходов за месяц:\t1.677.077р 46к",
    "Фактический остаток:\t-609.230р 46к\t20%",
    "-173.753 остаток с июня",
    "-28.000 субсидия, поступила в июле",
    "ИТОГ всех расходов за месяц:\t2.094.271р 36к",
    "Фактический остаток:\t-355.483р 36к\t20%",
    "Минус с июля 407.477р 46к, переходит",
    "+23.334р 76к остаток с инвестиций",
    "ИТОГ всех расходов за месяц:\t2.343.392р 37к",
    "Фактический остаток:\t96.628р 63к\t20%",
    "Минус с августа переходит 739.626р 06к",
    "ИТОГ всех расходов за месяц:\t2.865.042р 74к",
    "Фактический остаток:\tМинус 277.306р 74к\t20%",
    "Переходит минус с сентября 642.997р 43к",
    "ИТОГ всех расходов за месяц:\t2.030.572р 59к",
    "Фактический остаток:\tМинус 145.292р 59к\t20%",
    "Переходящий минус 920.304р 17к",
    "ИТОГ всех расходов за месяц:\t2.432.175р 89к",
    "Фактический остаток:\tМинус 113.901р 89к\t20%",
    "Переходящий минус 1.065.596р 76к",
    "ИТОГ всех расходов за месяц:\t695.836р 15к",
    "Фактический остаток:\t684.753р 85к",
    "ИТОГ всех расходов за месяц:\t920.954р 54к",
    "Фактический остаток:\t8.670р 46к",
    "Остаток с ноября \t684.753р 85к"]

let selectedFooterItemsJoined = """
ИТОГ всех расходов за месяц:    92.531р 15к
ИТОГ всех расходов за месяц:    1.677.077р 46к
Фактический остаток:    -609.230р 46к    20%
-173.753 остаток с июня
-28.000 субсидия, поступила в июле
ИТОГ всех расходов за месяц:    2.094.271р 36к
Фактический остаток:    -355.483р 36к    20%
Минус с июля 407.477р 46к, переходит
+23.334р 76к остаток с инвестиций
ИТОГ всех расходов за месяц:    2.343.392р 37к
Фактический остаток:    96.628р 63к    20%
Минус с августа переходит 739.626р 06к
ИТОГ всех расходов за месяц:    2.865.042р 74к
Фактический остаток:    Минус 277.306р 74к    20%
Переходит минус с сентября 642.997р 43к
ИТОГ всех расходов за месяц:    2.030.572р 59к
Фактический остаток:    Минус 145.292р 59к    20%
Переходящий минус 920.304р 17к
ИТОГ всех расходов за месяц:    2.432.175р 89к
Фактический остаток:    Минус 113.901р 89к    20%
Переходящий минус 1.065.596р 76к
ИТОГ всех расходов за месяц:    695.836р 15к
Фактический остаток:    684.753р 85к
ИТОГ всех расходов за месяц:    920.954р 54к
Фактический остаток:    8.670р 46к
Остаток с ноября     684.753р 85к
"""
